source/_static/diagrams/39-a-reframe-test-is-a-class-2.d2
direction: right
n0: "class"
n1: "valid_systems"
n2: "executable"
n3: "sanity / perf"
n0 -> n1
n1 -> n2
n2 -> n3
